//
//  File.swift
//  ARLaboratory
//
//  Created by 徐滔锴 on 2020/8/11.
//

import Foundation
struct Problem : Identifiable{
    let id = UUID();
    let title : String;
    let answer: Int;
    let choices: [String];
    
}


let problems  = [
    Problem(title:"物体沿主光轴逐步靠近凸透镜的过程中，在另一侧，光屏在距离凸透镜16厘米和24厘米处时分别能得到缩小和放大的像，那么请问该透镜的焦距可能为（ ）？", answer: 1, choices: ["8厘米","10厘米","12厘米","16厘米"]),
    Problem(title:"假设某凸透镜焦距为15厘米，当物体沿主光轴从距透镜25厘米处向50厘米处移动时，则（ ）？", answer: 2, choices: ["像变大，像距变大","像先变小后变大，像距变大","像变小，像距变小","像先变小后变大，像距变小"]),
    Problem(title:"在探究凸透镜成像规律实验中，将蜡烛从焦点处向远离凸透镜的方向移动的过程中，下列说法正确的是（ ）？", answer: 1, choices: ["像距先变大后变小","物与像的距离先变小后变大","像越来越大","物与像的距离先变大后变小"]),
    Problem(title:"物体位于距离凸透镜12cm处，在凸透镜另一侧20cm处成一个方法的实像，该凸透镜的焦距 f 大约是（ ）？", answer: 0, choices: ["10厘米 > f >6厘米","大于12厘米 ","12厘米 > f >10厘米","26厘米 > f >20厘米"]),
    Problem(title:"如果要使幻灯片在幕布上的清晰像更大一些，此时应该（ ）", answer: 1, choices: ["幻灯机靠近幕布，把镜头略向后移","幻灯机向后离幕布远一些，把镜头略向后移","幻灯机靠近幕布，把镜头略向前移","幻灯机向后离幕布远一些，把镜头略向前移"]),
    Problem(title:"在探究凸透镜成像规律实验中，将蜡烛从焦点处向远离凸透镜的方向移动的过程中，下列说法正确的是（ ）？", answer: 2, choices: ["像距先变大后变小","像越来越大","物与像的距离先变小后变大","物与像的距离先变大后变小"]),
    Problem(title:"在探究凸透镜成像的实验中，蜡烛到光屏的距离为50cm保持不变，某同学将一个焦距为10cm的透镜从光屏移向蜡烛的过程中，下列说法正确的是（ ）？", answer: 3, choices: ["能在屏上成一次清晰的像","能在屏上成三次清晰的像","不能在屏上成清晰的像","能在屏上成两次清晰的像"]),
]
